backend/app/Models/AssessmentLevelModel.php

SELECT `tblassessment_levels`.*, `tblcategory`.`name` as `category_name`
FROM `tblassessment_levels`
JOIN `tblcategory` ON `tblcategory`.`id` = `tblassessment_levels`.`categoryId`
WHERE `tblassessment_levels`.`deleted_at` IS NULL
---
    public function getAssessmentLevels()
    {
        return $this->select('tblassessment_levels.*, tblcategory.name as category_name')
                    ->join('tblcategory', 'tblcategory.id = tblassessment_levels.categoryId')
                    ->findAll();