backend/app/Models/MarketValueModel.php

SELECT `tblmarket_values`.*, `tblcategory`.`name` as `category_name`
FROM `tblmarket_values`
JOIN `tblcategory` ON `tblcategory`.`id` = `tblmarket_values`.`categoryId`
WHERE `tblmarket_values`.`deleted_at` IS NULL
---
    public function getMarketValues()
    {
        return $this->select('tblmarket_values.*, tblcategory.name as category_name')
                    ->join('tblcategory', 'tblcategory.id = tblmarket_values.categoryId')
                    ->findAll();